# Brewfile — Curated list of Homebrew packages, casks, and VS Code extensions.
#
# Install everything:  brew bundle --file=Brewfile
# Check status:        brew bundle check --file=Brewfile
# Clean up extras:     brew bundle cleanup --file=Brewfile

# =============================================================================
# Taps
# =============================================================================

tap "homebrew/services"
tap "jesseduffield/lazygit"
tap "midnightideas/extras"
tap "pulumi/tap"
tap "sass/sass"

# =============================================================================
# CLI Tools
# =============================================================================

brew "bat"              # cat with syntax highlighting and git integration
brew "coreutils"        # GNU core utilities (macOS ships BSD versions)
brew "curl"             # HTTP client (newer than macOS built-in)
brew "diff-so-fancy"    # Better-looking git diffs
brew "eza"              # Modern ls replacement (colors, icons, git status)
brew "fd"               # Modern find replacement (simpler syntax, faster)
brew "fzf"              # Fuzzy finder for files, history, and more
brew "gh"               # GitHub CLI
brew "git"              # Latest git (macOS version lags behind)
brew "git-lfs"          # Git Large File Storage
brew "gum"              # Pretty shell script prompts and formatting
brew "helix"            # Modal text editor (Rust-based)
brew "lazygit"          # Terminal UI for git
brew "mas"              # Mac App Store CLI (install apps from the terminal)
brew "neovim"           # Extensible Vim fork with Lua config
brew "poppler"          # PDF rendering library and CLI tools
brew "ripgrep"          # Fast grep replacement (rg)
brew "starship"         # Cross-shell prompt with sensible defaults
brew "tmux"             # Terminal multiplexer
brew "tree"             # Directory listing as a tree
brew "wget"             # HTTP client for downloading files
brew "zoxide"           # Smarter cd that learns your habits

# =============================================================================
# Languages & Build Tools
# =============================================================================

brew "cmake"            # Cross-platform build system
brew "golangci-lint"    # Go linter aggregator
brew "hugo"             # Static site generator (Go-based)
brew "pnpm"             # Fast Node.js package manager
brew "pyenv"            # Python version manager
brew "pulumi/tap/pulumi" # Infrastructure as code
brew "sass/sass/sass"   # Sass CSS preprocessor

# =============================================================================
# Git Extras
# =============================================================================

brew "midnightideas/extras/git-credential-1password" # 1Password git credential helper

# =============================================================================
# Casks (GUI apps installed via Homebrew)
# =============================================================================

cask "1password-cli"            # 1Password CLI (op)
cask "git-credential-manager"   # Git Credential Manager
cask "raycast"                  # Spotlight replacement with extensions

# =============================================================================
# Fonts
# =============================================================================

cask "font-anonymice-nerd-font"             # AnonymicePro Nerd Font
cask "font-atkinson-hyperlegible"           # Atkinson Hyperlegible (accessibility)
cask "font-atkinson-hyperlegible-next"      # Atkinson Hyperlegible Next
cask "font-fantasque-sans-mono-nerd-font"   # Fantasque Sans Mono Nerd Font
cask "font-nunito-sans"                     # Nunito Sans (used in Zen Browser)
cask "font-raleway"                         # Raleway (used in Zen Browser)

# =============================================================================
# Mac App Store — see Brewfile.mas (installed separately to avoid auth prompts)
# =============================================================================

# =============================================================================
# VS Code Extensions
# =============================================================================

# Core
vscode "anthropic.claude-code"
vscode "vscodevim.vim"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "dbaeumer.vscode-eslint"
vscode "sleistner.vscode-fileutils"
vscode "ms-vscode.live-server"
vscode "ms-vscode.makefile-tools"

# Python
vscode "charliermarsh.ruff"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-python.debugpy"
vscode "ms-python.autopep8"
vscode "ms-python.black-formatter"
vscode "ms-python.isort"
vscode "ms-python.pylint"
vscode "donjayamanne.python-environment-manager"

# Jupyter
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"

# Go
vscode "golang.go"

# Haskell
vscode "haskell.haskell"
vscode "justusadam.language-haskell"

# Web / Markdown
vscode "astro-build.astro-vscode"
vscode "unifiedjs.vscode-mdx"
vscode "davidanson.vscode-markdownlint"
vscode "yzane.markdown-pdf"

# Containers & Remote
vscode "docker.docker"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.remote-explorer"

# Collaboration
vscode "github.copilot-chat"
vscode "github.vscode-pull-request-github"
vscode "ms-vsliveshare.vsliveshare"

# WebAssembly
vscode "dtsvet.vscode-wasm"
vscode "jcmellado.vscode-wasm-essentials"
vscode "jcmellado.vscode-wasm-syntax-lite"

# Accessibility & Quality
vscode "ban.spellright"
vscode "deque-systems.vscode-axe-linter"
vscode "maxvanderschee.web-accessibility"
vscode "kjaymiller.vscode-add-code-of-conduct"

# Appearance
vscode "emmanuelbeziat.vscode-great-icons"
vscode "ekelley.midnight-synth"
vscode "guilhermerodz.omni-owl"
vscode "hilalh.hyper-dracula-vscode-theme"
vscode "omthemes.omthemes"
vscode "samrapdev.outrun"
vscode "oderwat.indent-rainbow"

# Utilities
vscode "ganeshnr.jsonviewer007"
vscode "grapecity.gc-excelviewer"
vscode "gruntfuggly.todo-tree"
vscode "wayou.vscode-todo-highlight"
